doc/ox-hugo-manual.org
#+TITLE: Ox-Hugo Manual
#+AUTHOR: Kaushal Modi

#+HUGO_BASE_DIR: .
#+HUGO_SECTION: doc

#+MACRO: imageclick [[file:./static/images/$1][file:/images/$1]]
#+MACRO: issue [[[https://github.com/kaushalmodi/ox-hugo/issues/$1][$1]]]

*** Meta Features
:PROPERTIES:
:EXPORT_FILE_NAME: meta-features
:END:
- [X] Extensive tests! -- [[https://github.com/kaushalmodi/ox-hugo/tree/master/test/site/content-org][test/site/content-org]] (=make test=)
- [X] Travis CI Integration -- Checks with emacs versions starting from
  24.4->25.2, with the latest stable version of =org-plus-contrib=.
- [X] [[https://ox-hugo.scripter.co][Documentation site]] -- Generated using =ox-hugo= itself (=make
  doc=).
- [X] [[../test][Test site]] -- Regenerated after each commit to this repo
- [X] Passes =make test= and generates documentation using =make doc=
  in [[https://play.google.com/store/apps/details?id=com.termux&hl=en][Termux]] app on Android too.
- [X] Passes =checkdoc= and =package-lint= ([[https://github.com/purcell/package-lint/issues/89][/almost/]]).
