doc/content/doc/meta-features.md
+++
title = "Meta Features"
draft = false
[menu.meta]
  weight = 3001
  identifier = "meta-features"
+++

-   [X] Extensive tests! -- [test/site/content-org](https://github.com/kaushalmodi/ox-hugo/tree/master/test/site/content-org)
-   [X] Travis CI Integration -- Checks with emacs versions starting from
    24.4->25.2, with the latest stable version of `org-plus-contrib`.
-   [X] [Documentation site](https://ox-hugo.scripter.co) -- Generated using `ox-hugo` itself.
-   [X] [Test site](../test) -- Regenerated after each commit to this repo
-   [X] Passes `make test` and generates documentation using `make doc`
    in [Termux](https://play.google.com/store/apps/details?id=com.termux&hl=en) app on Android too.
-   [X] Passes `checkdoc` and `package-lint` ([_almost_](https://github.com/purcell/package-lint/issues/89)).
